from ___Libraries___ import *

class Data():
    def Search(self,text):
        def WhatToSearch(text):
            SplitText=text.split(" ")
            try:
                SplitText.remove("جستوجو")
            except :
                None
            try:
                SplitText.remove("جستجو")
            except :
                None
            try:
                SplitText.remove("جست")
            except :
                None
            try:
                SplitText.remove("جو")
            except :
                None
            try:
                SplitText.remove("سرچ")
            except :
                None
            try:
                SplitText.remove("کن")
            except :
                None
            try:
                SplitText.remove("بکن")
            except :
                None
            try:
                SplitText.remove("درباره")
            except :
                None
            try:
                SplitText.remove("را")
            except :
                None
            try:
                SplitText.remove("رو")
            except :
                None
            Output=""
            for i in SplitText:
                Output+=(str(i)+" ")
            return Output
        text=WhatToSearch(text)
        
        wikipedia.set_lang("fa")  
        suggestions=(wikipedia.search(text, results=1))
        suggestion =(suggestions[0])
        a=(wikipedia.summary(suggestion, sentences=2))  
        Audio().TTS(a,"fa") 

        try:
            text=""
            r=sr.Recognizer()
            mic = sr.Microphone()

            with mic as source:
                audio = r.listen(source)
            return ("Checking")
            text = r.recognize_google(audio, language='fa-IR')# language  set farsi :)
            return str(text)
        except:
            return ""
    
    def DATA_function(self,text):
        Game_List=['صالحه', 'یاسمن', 'لطیفه', 'مهشید', 'نازیلا', 'صدرا', 'برنامه', 'شاهرخ', 'هیراد', 'حمیده', 'بهزاد', 'کرم', 'نبی', 'ارغوان', 'احمد', 'اسما', 'ثمین', 'ساحره', 'مريم', 'مرسل', 'محمدعلی', 'ایلیا', 'رشید', 'واصف', 'حلیمه', 'رافع', 'مریم', 'فردین', 'آریا', 'فريد', 'رضیه', 'آصف', 'کمیل', 'آیین', 'مهراب', 'هوتن', 'سوده', 'عمار', 'محمد', 'رضابابایی', 'محمودرضا', 'فرهمند', 'جاوید', 'هاتف', 'رعنا', 'اقبال\u200cعلی', 'سیده', 'کاکا', 'مظاهر', 'خشایار', 'بشیر', 'ریاض', 'شکوه', 'کامین', 'یوسفعلی', 'صبریه', 'درنا', 'پگاه', 'اكبر', 'مبارک', 'پروانه', 'حوریه', 'عطاء', 'زائر', 'نیره', 'نويد', 'فرهنگ', 'نجیبه', 'طارق', 'شمس\u200cالدین', 'مصلح', 'فضیل', 'امیرحسن', 'برزو', 'كامران', 'اکبر', 'سجاد', 'نرگس', 'ناهيد', 'فرزاد', 'شادي', 'طوبی', 'علا', 'اویس', 'غمزه', 'نجمه', 'ستايش', 'ضیا\u200cالدین', 'صمیم', 'عابده', 'ناديا', 'آیدین', 'ثامر', 'سبحان', 'میثم', 'صانع', 'غزاله', 'شراره', 'افسانه', 'سينا', 'عاصم', 'عبدالرفیع', 'محمدصادق', 'حنیفه', 'رحمان', 'ابوالقاسم', 'وحیده', 'زانیار', 'ریحانه', 'عاقله', 'زین\u200cالدین', 'محمدسالار', 'حسن', 'منیر', 'یحیی', 'عهدیه', 'سروش', 'فربد', 'عاطفه', 'کاوه', 'عبدالحسن', 'ابوذر', 'طیبه', 'ساره', 'رضوان', 'عزیزالله', 'شهاب\u200cالدین', 'جمال', 'شروین', 'ستار', 'صنعان', 'طناز', 'میلان', 'صیاد', 'قادر', 'متینه', 'رایحه', 'سیمین', 'صنم', 'زاهر', 'لبیب', 'سلما', 'تهمینه', 'میلانا', 'محسن', 'عباس', 'نادیا', 'آیهان', 'شمیس', 'عبدالهادی', 'امید', 'فروز', 'صاحب', 'فرزام', 'صدف', 'توفیق', 'زینب', 'عطیه', 'زهرا', 'حسانه', 'مطهره', 'مهدا', 'فریناز', 'علی\u200cرضا', 'شاکر', 'سوگند', 'دیوید', 'پویا', 'حنانه', 'منظر', 'امیرپارسا', 'عزالدین', 'وهاب', 'زاهده', 'محمدحسین', 'اميرمحمد', 'عادل', 'بدری', 'نیلوفر', 'رسول', 'سهراب', 'طاها', 'میسان', 'اسماء', 'صداقت', 'شیرین', 'نرجس', 'مرسا', 'ندیم', 'صبا', 'سینا', 'محمدامین', 'مولود', 'اعظم', 'عالیه', 'عبدالرسول', 'دیاکو', 'ﺣﺴﻴﻦ', 'سیروس', 'جنید', 'کامل', 'لطیف', 'مسیب', 'ترمه', 'رزان', 'محترم', 'مختار', 'فرحان', 'مهدیار', 'عبدالعزیز', 'حامد', 'غیاث', 'سعید', 'فصیح', 'مرجان', 'آيه', 'خاطره', 'یاسمین', 'زکی', 'رحیمه', 'خضر', 'مهنا', 'علی\u200cمراد', 'ساسان', 'فیاض', 'مجیرالدین', 'امیر', 'اسماعیل', 'نیما', 'اذين', 'عبدالقادر', 'یعقوب', 'حبیبه', 'یزدان', 'میلاد', 'حسين', 'ساحل', 'عبدالحی', 'صادقه', 'مطیب', 'نادی', 'حامی', 'نریمان', 'شعبان', 'میترا', 'ایوب', 'نازنین', 'سمین', 'سلیم', 'شادی', 'آرین', 'کورش', 'هما', 'رفیعه', 'عقیل', 'عین\u200cالدین', 'مظفر', 'عبدالغفور', 'فرج', 'آبدین', 'صفا', 'ب', 'نيما', 'مهتا', 'اروین', 'سمیرا', 'میثاق', 'یاشار', 'واران', 'عبداللطیف', 'یدالله', 'مهرنوش', 'ستیلا', 'ساعده', 'فرشيد', 'سلوی', 'حیفا', 'مدینه', 'قاهر', 'َآرش', 'شیوا', 'بهجت', 'شکیل', 'فایزه', 'فرشید', 'سمیه', 'وریا', 'سامان', 'شهباز', 'کوروش', 'محمدمحسن', 'فتاح', 'غفور', 'نورالدین', 'دانیال', 'مهندس', 'ساجده', 'نصر', 'میوند', 'کسری', 'مصباح', 'طاهر', 'نگار', 'روح', 'فرحانه', 'ربیع', 'واهب', 'آنسه', 'رحمت', 'کریمه', 'پریساحسین', 'ترنم', 'آلاء', 'عمید', 'سرور', 'پرستو', 'رستم', 'خیزران', 'صادق', 'امين', 'شیدا', 'ربابه', 'اميرحسين', 'نادره', 'امیررضا', 'محفوظ', 'شبلی', 'عبدالحق', 'مجیر', 'مهام', 'عبدالمجید', 'بابک', 'آقای', 'نهال', 'طه', 'عبدالواحد', 'میسا', 'مبین', 'حمزه', 'سمیه.', 'مهری', 'همام', 'آروين', 'سهیلا', 'زکیه', 'مونس', 'عبدالصمد', 'برهان', 'سحاب', 'تبسم', 'توحید', 'ماهر', 'رایموند', 'بهاره', 'فریعد', 'کبری', 'امیرپوریا', 'گیلدا', 'رضی', 'طالب', 'اشکان', 'حارثه', 'بشرا', 'رابعه', 'محبوبه', 'عابس', 'کمال', 'نعیمه', 'ماه', 'مهشيد', 'شادمان', 'شایان', 'اوبالیت', 'اللهیار', 'فاطر', 'اوحد', 'کیسان', 'آبد', 'صلاح\u200cادین', 'عمرو', 'مجتبي', 'فرح', 'شکرالله', 'مرتضی', 'علی\u200cاکبر', 'نجات', 'زاره', 'احسان', 'غزال', 'طلحه', 'عبدالحسین', 'ماشاءالله', 'حمیرا', 'بنیامین', 'مکرمه', 'نسرین', 'کامله', 'صمصام', 'بلور', 'مجدالدین', 'راستین', 'هرون', 'سامیه', 'ارشاد', 'آران', 'شمیم', 'فرشته', 'امیر\u200cحسین', 'عبدالباسط', 'شکوفه', 'رایان', 'امیرمحسن', 'پیام', 'ایلماز', 'سچاد', 'سپیده', 'مالک', 'صهبا', 'شفیعه', 'طاهره', 'رایکا', 'سیدفرشاد', 'رأفت', 'ثاقب', 'سحر', 'حميد', 'پوریا', 'عسل', 'تمنا', 'محمدقاسم', 'صفیه', 'جاسم', 'عمران', 'مهناز', 'آتنا', 'هادى', 'مهتاب', 'شاهین', 'محمود', 'سمیع', 'متین', 'اکرم', 'راحله', 'ابولفضل', 'مرجع', 'وحید', 'سها', 'صاعد', 'روژان', 'مشهود', 'عینعلی', 'آرام', 'نسترن', 'نسیم', 'حسام', 'سیدرضا', 'ضرغام', 'میحاد', 'کیان', 'هژیر', 'اميرعلي', 'مهراد', 'ملوک', 'علی\u200cاصغر', 'عادیات', 'شادن', 'عبدالخالق', 'مشکوه', 'صغری', 'هامر', 'مائده', 'ماهان', 'هلما', 'تیتکا', 'هایده', 'حامت', 'عبدالغفار', 'یوسف', 'پریسا', 'پریا', 'سامی', 'امینه', 'مسلم', 'نسيم', 'گلنار', 'ندا', 'مرسده', 'مژگان', 'مانی', 'ریحان', 'الاهه', 'فصیحه', 'تکتم', 'واحد', 'سار', 'اسنا', 'پژمان', 'اهدا', 'پرهام', 'عامر', 'سامر', 'احمدعلی', 'مجتبى', 'کیارش', 'آرزو', 'هاجر', 'عطا', 'راحیل', 'سامیرا', 'محنا', 'امیرمهران', 'نجوا', 'پيام', 'پويان', 'یسری', 'مینو', 'عبادالله', 'غضنفر', 'مینا', 'عبدالجواد', 'حمیدرضا', 'سیف\u200cالله', 'دیوا', 'نقی', 'صفر', 'عاشیه', 'یک', 'فریبا', 'ثمینه', 'شبنم', 'سامره', 'افضل', 'فواد', 'آذر', 'سیدحمزه', 'سیدرسول', 'شهره', 'نظام', 'سمانه', 'بشری', 'شادمهر', 'هانيه', 'عمر', 'معصومه', 'احد', 'محمدرضا', 'مجیبه', 'رافق', 'مسیح', 'سیدعلیرضا', 'حدیث', 'جابر', 'علی', 'لادن', 'شریف', 'عمین', 'مجيد', 'علیم', 'یکتا', 'ساعد', 'امیرحسین', 'ساناز', 'نعمت', 'ورشان', 'منذر', 'صالح', 'اعلی', 'ام\u200cالبنین', 'یمنا', 'قدرت', 'ماهد', 'عبدالعظیم', 'فتانه', 'صباح', 'اشكان', 'محمدجواد', 'انسیه', 'فوزیه', 'پریسادایی', 'دارا', 'مهدیه', 'ابوالفضل', 'اسدالله', 'حنا', 'امیرعلی', 'فهیمه', 'فاطمه\u200cگرامی', 'هومن', 'مهدي', 'سعیده', 'گروه', 'ملیحه', 'ماتریکس', 'سونیا', 'کامبیز', 'صفی\u200cالدین', 'رضا', 'امیر\u200cمحمد', 'بهادر', 'حره', 'فتح\u200cالله', 'فریده', 'پدرام', 'عماد', 'مهلا', 'مصطفي', 'ارشیا', 'جلال', 'بهناز', 'کلثوم', 'امير', 'خیرالدین', 'آرش', 'سالار', 'مونا', 'ثریا', 'امیر\u200cعباس', 'شهاب', 'ساقی', 'فرج\u200cالله', 'حمید', 'آیت', 'محدثه', 'مهشاد', 'رامیار', 'پیروز', 'آصفه', 'فاخته', 'ناریه', 'ابوالحسن', 'سلیمه', 'جمیله', 'رگداد', 'لقمان', 'دنیا', 'تمیم', 'آزیتا', 'ارسلان', 'پارمیس', 'طهورا', 'کامیاب', 'رضوانه', 'نورالله', 'عظیمه', 'قیصر', 'عبدالجلیل', 'دانشجوی', 'ضیغم', 'لیالی', 'احترام', 'رژان', 'رسام', 'ذبیح\u200cالله', 'سلطان', 'ظهیره', 'شهلا', 'نوریه', 'آریان', 'مرضیه', 'نوید', 'عصمت', 'سوشا', 'عبدالرشید', 'ابراهیم', 'سیدامیرقاضی', 'مرضيه', 'منا', 'آرين', 'غزل', 'امیرعطا', 'غلامرضا', 'شکور', 'آیدا', 'هیمن', 'مرصاد', 'بلال', 'عبدالغنی', 'وثوق', 'طلوع', 'هانی', 'سعد\u200cالدین', 'باقر', 'ماجده', 'آلنوش', 'شمس', 'سید', 'جنت', 'کلیم', 'مظهر', 'پاتریس', 'زهره', 'ولید', 'محمدرسول', 'شعله', 'یمین', 'معراج', 'امیر\u200cمهدی', 'پرند', 'عنایت', 'غفار', 'سيّد', 'پاتریک', 'نغمه', 'امیرمحمد', 'لیلا', 'سیدسجاد', 'آرشام', 'آیلار', 'البرز', 'ضیا', 'صدر', 'مهران', 'بنيامين', 'نسا', 'شفیع', 'رقیه', 'رفیع', 'عبدالحلیم', 'حدیثه', 'ميلاد', 'شعیب', 'عیسی', 'عنایت\u200cالله', 'عبدالله', 'کیومرث', 'کیا', 'عبدالفتاح', 'عظیم', 'پرنیان', 'سکینه', 'تیم', 'بهروز', 'سایت', 'سالمه', 'غیاث\u200cالدین', 'فاتح', 'مازیار', 'خلیل', 'حجت', 'راشن', 'مژده', 'محراب', 'ادیب', 'ماهنامه', 'آنی', 'رجب', 'شاهر', 'امین', 'عبیدالله', 'هدی', 'مچید', 'بنفشه', 'منصوره', 'خسرو', 'شکرعلی', 'خیرعلی', 'رویا', 'مقداد', 'هیبت', 'رامین', 'عرفان', 'سیما', 'دانوش', 'محمدصالح', 'بهار', 'ناصر', 'بتول', 'احلام', 'حلما', 'ظهیر', 'عبدالجبار', 'عبدالوهاب', 'فریدون', 'فرشاد', 'عبدالحمید', 'صابرین', 'سمیر', 'عاشور', 'غلامعباس', 'رباب', 'غلام', 'یاسر', 'مرشد', 'میعاد', 'حامده', 'هود', 'سيدمرتضي', 'محسنه', 'الینا', 'سعيد', 'فائز', 'عبدالرحیم', 'فاطیما', 'شهریار', 'ارمغان', 'عارفه', 'شقایق', 'عباد', 'گلستان', 'مهرناز', 'مهیره', 'کیمیا', 'عادله', 'عبدالکریم', 'جاهد', 'ملیکه', 'کامران', 'رجا', 'عبدالنبی', 'صفی', 'شريف', 'رزیتا', 'عبدالقاهر', 'جواهر', 'شیما', 'نام', 'ماریه', 'صابره', 'امیرمهدی', 'حسنا', 'سلاله', 'امیر\u200cطاها', 'رمضان', 'اقدس', 'مجتبی(شاهپور)', 'سلمان', 'صفار', 'ثنا', 'ملینا', 'نعیم', 'سعود', 'داود', 'حکیمه', 'صابر', 'مصیب', 'فتحعلی', 'لمیا', 'صیام', 'شجاع\u200cالدین', 'لیث', 'کوثر', 'مجتبی', 'عبدالعلی', 'ضرغامه', 'عامره', 'هدیه', 'مجید', 'اسامه', 'عبداله', 'شهیر', 'محتشم', 'یونس', 'محبوب', 'سیدمحمدمسعود', 'حوا', 'جلیل', 'محمدحسن', 'نسیبه', 'رمیصا', 'سیدامیرحسین', 'ماجد', 'همت', 'کاشف', 'حانیه', 'فائقه', 'مکیه', 'زاکیه', 'آرمان', 'نعیما', 'صدرالدین', 'ایدین', 'ليلا', 'بهرام', 'سیدعلی', 'یاسین', 'سحرمحمد', 'پویان', 'نصیر', 'المیرا', 'ماندانا', 'رانیا', 'ساهره', 'باران', 'شفیقه', 'فایضه', 'مهدی', 'بهنام', 'سپهر', 'اسداله', 'ظریف', 'جبار', 'رئوف', 'نسرين', 'انیس', 'قمر', 'خزعل', 'نادیه', 'عزیز', 'نادر', 'دریا', 'جواد', 'صمد', 'محمدسعید', 'فاطمه', 'وسیمه', 'نجف', 'آرمین', 'قدیسه', 'ذبیح', 'شیبان', 'قهار', 'طنین', 'عباسعلی', 'عبدالناصر', 'قائد', 'زینعلی', 'ژیار', 'تينا', 'آسیه', 'پري', 'مصطفی', 'مستر', 'آنيتا', 'مهپی', 'عبدالستار', 'لاوان', 'وجیهه', 'فریبرز', 'تسنیم', 'صحرا', 'کامیار', 'حلیه', 'سیاوش', 'داريوش', 'معید', 'نشاط', 'هانیه', 'نصیبه', 'منوره', 'موسی', 'زیبا', 'فراز', 'سیدامیرمحمد', 'افشین', 'میلاداسماعیل', 'سیدکریم', 'تقی', 'نجلا', 'شهروز', 'حبیب', 'پارسا', 'نازنين', 'سهيل', 'هانیا', 'طراوت', 'خیراالله', 'عفت', 'سمیح', 'صفی\u200cالله', 'منصور', 'نوال', 'نگین', 'مرىم', 'هادی', 'مشیر', 'سهیل', 'پیمان', 'عدنان', 'کامی', 'عبدالرزاق', 'نوشی', 'رو', 'الیاس', 'کیوان', 'بیتا', 'آیه', 'جعفر', 'اصغر', 'جادی', 'رافعه', 'مسعود', 'طلایه', 'راشد', 'حسنعلی', 'گلسا', 'سيده', 'افق', 'خضرا', 'اروشا', 'منیره', 'کوکب', 'رزاق', 'نهام', 'هاشم', 'علوان', 'دانيال', 'مراد', 'ارس', 'علیرضا', 'عفیفه', 'عزت', 'كيارش', 'زید', 'سمر', 'مارال', 'فرزان', '\u200cهانا', 'سپيده', 'طلا', 'فخرالدین', 'ولی', 'بهمن', 'شاهد', 'نعمان', 'شهرام', 'اسحاق', 'سیدمرتضا', 'نفیسه', 'واله', 'فرزین', 'شمیمه', 'هدایت', 'یگانه', 'مهدیس', 'فرساد', 'افسون', 'راشا', 'راحل', 'اطهر', 'ثمر', 'محیا', 'نصرالله', 'خدیجه', 'سیدمصطفی', 'محمدکاظم', 'غلامحسین', 'فرهاد', 'راضیه', 'شرکت', 'معین', 'آزاده', 'مبینا', 'سدن', 'ساجد', 'عزت\u200cالله', 'حنّان', 'کاظم', 'طیب', 'سومینا', 'سبا', 'زهیر', 'جلوه', 'لطفعلی', 'حداد', 'وصال', 'صلاح', 'عالمه', 'ظفر', 'سایه', 'صائب', 'عبدالمحمد', 'فاضل', 'جعفرامامی', 'شایگان', 'سیامک', 'بصیر', 'محمداعظم', 'معبود', 'عبدالباقی', 'عبدالرحمان', 'فرزانه', 'فرید', 'بهلول', 'عبدالرضا', 'لؤی', 'آزيتا', 'تراب', 'بها', 'الهه', 'آفاق', 'زمزم', 'صدیق', 'بهراد', 'قاسم', 'سیداشکان', 'علاء\u200cالدین', 'عذرا', 'الهام', 'مهسا', 'سیدامیر', 'حدیقه', 'شریفه', 'وسیم', 'ذوالفقار', 'فرنام', 'ادریس', 'آتیه', 'کریم', 'ایناس', 'سيد', 'پریدخت', 'نوین', 'ناهید', 'سارا', 'سما', 'اعتبار\u200cعلی', 'داریوش', 'ایمان', 'طلیعه', 'ساینا', 'سعيده', 'مهرداد', 'فائزه', 'آمنه', 'حفصه', 'صدیقه', 'ساغر', 'مرصع', 'لیلیا', 'محمدمهدی', 'حسین', 'سعدی', 'عابد', 'لیلی', 'واجد', 'علي', 'فریدالدین', 'وحدت', 'مهیار', 'ضحی', 'ندیمه', 'ﻣﻬﺪﻱ', 'داوود', 'قنبر', 'عبدالملک', 'سیدحسن', 'روح\u200cالله', 'رحیم', 'عارف', 'زینت', 'خالد', 'احمدرضا', 'زعیم', 'عین\u200cالله', 'منوچهر', 'حیات', 'عزیزه', 'فرهود', 'هنیا','هستی']
        politicsURL = {
            'irna': 'https://www.irna.ir/rss/tp/5',}
        economyURL = {
            'irna': 'https://www.irna.ir/rss/tp/20',}
        worldURL = {
            'irna': 'https://www.irna.ir/rss/tp/1',}
        socialURL = {
            'irna': 'https://www.irna.ir/rss/tp/32',}
        sportsURL = {
            'irna': 'https://www.irna.ir/rss/tp/14',}
        scienceURL = {
            'isna': 'https://www.isna.ir/rss/tp/5',}
        cultureURL = {
            'irna': 'https://www.irna.ir/rss/tp/41',}
        return [
                    [['چطوره',"احوالت","حالت","چطوری","خوبی","حالت خوبه","حالت خوب است"],["عالی","خوبم","بهتر از این نمیشه","یِکَم خستم","بهترینم"],[]],
                    [["اسمت"],["من اکبر هستم"],[]],
                    [["کی هستی"],[" من اکبر هستم.  یک ربات با هوشِ مصنوعیِ قوی و آماده خدمتِ به شما"],[]],
                    [["چی کار","چیکار"],["من هر کاری که نیاز داشته باشی رُ میتونم انجام بدم"],[]],
                    [["ساخته","ساختن"],["آقایان علیرضا شعبانی و پارسا سلیمانی"],[]],
                    [["درود بر شما","درود","سلام","سلامٌ عَلِیکُم","درود فراوان","سلام بر تو باد","درودِ فراوان","سلام"],["درود بر شما","درود","سلام","سلامٌ عَلِیکُم","درود فراوان","سلام بر تو باد","درودِ فراوان"],[]],
                    [["سوره","قران","قرآن"],[],[[Audio().MusicPlay,(random.choice(["Sooreh_1"]))+"()"+text]]],
                    [["اذان","ازان"],[],[[Audio().MusicPlay,((random.choice(["Azan"]))+"()"+text)]]],
                    [["بهنام","بانی"],[],[[Audio().MusicPlay,random.choice(Audio().MusicNames("‌BehnamBani",1))+"()"+text]]],
                    [["حامد","بهرام"],[],[[Audio().MusicPlay,random.choice(Audio().MusicNames("HamedBahram",1))+"()"+text]]],
                    [["آرون","افشار"],[],[[Audio().MusicPlay,random.choice(Audio().MusicNames("AronAfshar",1))+"()"+text]]],
                    [["موزیک ترکیه","آهنگ ترکیه",],[],[[Audio().MusicPlay,random.choice(Audio().MusicNames("Turkish",1))+"()"+text]]],
                    [["گیتار","جیپسی","فلامینگو"],[],[[Audio().MusicPlay,random.choice(Audio().MusicNames("Gypsy",1))+"()"+text]]],
                    [["جهان بخش","جهانبخش","بابک"],[],[[Audio().MusicPlay,random.choice(Audio().MusicNames("BabakJahanbakhsh",1))+"()"+text]]],
                    [["موزیک","آهنگ","اهنگ"],[],[[Audio().MusicPlay,(random.choice(Audio().AllMusicsList())+"()"+text)]]],     #all musics
                    [["پسری","پسر هستی","دختری","دختر هستی","جنسیت"],["من یک ربات هستم ولی اسمِ من پسرانه است"],[]],
                    [["چند سال","به دنیا","تولد","سن"],["من کمتر از یک سال دارم"],[]],
                    [["عشقم","عزیزم","خوشم میاد","عاشقتم","دوستت دارم","تورو دوست دارم","شمارو دوست دارم"],["من هم شما رو دوست دارم"],[]],
                    [["چه کاری علاقه داری","چه کاری لذت میبری","چه کاری خوشت میاد","چه کاری رو دوست داری","چه کاری را دوست داری","چه کاری دوست داری"],["من عاشقِ باطری هستم و همیشه دوست دارم باطری اِستِعمال کنم"],[]],
                    [["رنگ","رنگی"],["من عاشق رنگِ سفید هستم"],[]],
                    [["چند شنبه"],[],[[DateAndWeather().Day]]],
                    [["چندم","تاریخ"],[],[[DateAndWeather().Date]]],
                    [["ساعت چنده"],[],[[DateAndWeather().Time_Now]]],
                    [["خبر فرهگ","اخبار فرهگ","خبر هنر","اخبار هنر"],[],[[Others().News,cultureURL]]],
                    [["خبر علم","اخبار علمی","خبر دانش","اخبار دانش"],[],[[Others().News,scienceURL]]],
                    [["خبر ورزش","اخبار ورزشی"],[],[[Others().News,sportsURL]]],
                    [["خبر اجتماع","اخبار اجتماع"],[],[[Others().News,socialURL]]],
                    [["خبر جهان","اخبار جهان"],[],[[Others().News,worldURL]]],
                    [["خبر اقتصاد","اخبار اقتصاد"],[],[[Others().News,economyURL]]],
                    [["خبر سیاس","اخبار سیاس"],[],[[Others().News,politicsURL]]],
                    [["اخبار"],[],[[Others().News,random.choice([sportsURL,socialURL,worldURL,economyURL,politicsURL,cultureURL,scienceURL])]]],
                    [["طلا"],[],[[Prices().GoldPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["ربع سکه"],[],[[Prices().RobCoin,Prices().GetSomeInfoAboutPrice()]]],
                    [["نیم سکه"],[],[[Prices().HalfCoinPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["تمام سکه","سکه تمام"],[],[[Prices().FullCoinPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["دلار"],[],[[Prices().DollarPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["یورو"],[],[[Prices().EuroPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["پوند"],[],[[Prices().PondPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["درهم"],[],[[Prices().DerhamPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["لیر"],[],[[Prices().LirPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["بیتکوین","بیت کوین"],[],[[Prices().BitCoinPrice,Prices().GetSomeInfoAboutPrice()]]],
                    [["جواب","مجموع","حاصل"],[],[[Others().Calculater,text]]],
                    [["هوا","دما","باد"],[],[[DateAndWeather().Temperature,text]]],
                    [["جک","جوک"],[],[[Others().Joke]]],
                    [["سرچ","جست و جو","جستجو"],[],[[Data().Search,str(text)]]],
                    [["پادکست"],[],[[Audio().MusicPlay,(random.choice(["Podcast"]))+"()"+text]]],
                    [["شعر","اخوان","دکلمه","باغ بی برگی"],[],[[Audio().MusicPlay,(random.choice(["BaghBiBargi"]))+"()"+text]]],
                    [["سرود"],[],[[Audio().Anthems,text]]],
                    [["بازی"],[],[[Game().Game_Panel]]],
                    ]
    
    def Analyse_Function(self,text,DATA):
        Done=False
        for i in range (len(DATA)):
            if Done==True:
                break
            for Each_Question in DATA[i][0]:
                if str(Each_Question) in text:
                    if DATA[i][1]!=[]:
                        Audio().TTS(str(random.choice(DATA[i][1])),"fa")
                    if DATA[i][2]!=[]:
                        func=random.choice(DATA[i][2])
                        if len(func)>1:
                            func[0](random.choice(func[1:len(func)]))
                        else:
                            func[0]()
                    return True
        return False
    
    def WHQ(self,text):
        WHlist=['کیه','کدامه','چطوره','چرا' ,'چرا','چه','چطور','چه','کجا','کی','چی','کدام']
        for WH in WHlist:
            for word in (text.split(" ")):
                if word==WH:
                    return True
        return False
    
    def YNQ(self,text):
        YNlist=['آیا',"ایا"]
        for YN in YNlist:
            if YN in text:
                return True
        return False
    
    def MergeList(self,List):
        Out=""
        for word in List:
            if word == "تو" or word == "شما":
                word="من"
            Out+=word+" "
        Out=Out.replace("شما","من")
        Out=Out.replace("تو","من")
        return Out
    
    def Analyse_Closest(self,text,DataBase):
        DataTouple=DataBase
        DataList=[]
        TextSplit=text.split(" ")
        for List in DataTouple:
            RemoveList=list(List)
            Similarity=0
            for ClientWord in TextSplit:
                for DataWord in List:
                    if ClientWord==DataWord:
                        RemoveList.remove(DataWord)
                        Similarity+=1
                        break 
            DataList.append([Similarity/len(List),DataTouple.index(List),Data().MergeList(RemoveList)])
        #print (max(DataList))
        BestChoice=(max(DataList))
        if BestChoice[0]<=0.7:
            return False
        Audio().TTS(BestChoice[2])
        return True
    
    def AddToDataBase(self,text):
        FileData=open("___DataBase___.py","a+")
        List=text.split(" ")
        print (","+str(List)+"\n")
        FileData.write(str(","+str(List)))
        FileData.close()

    def PWD(self):
        import subprocess
        proc = subprocess.Popen(["pwd"], stdout=subprocess.PIPE, shell=True)
        (out, err) = proc.communicate()
        out=str(out)
        out=(out[2:len(out)-3])
        return out
    
print (Data().PWD())