import speech_recognition as sr
import random
import wikipedia 
from googletrans import Translator
import os
import random
from persiantools.jdatetime import JalaliDate
import khayyam
from time import sleep
from mpyg321.mpyg321 import MPyg321Player
from mutagen.mp3 import MP3
import feedparser
import mysql.connector as sql
import requests
from bs4 import BeautifulSoup
from math import sqrt
import sys
import numpy
import csv
from forecastiopy import *
from __Audio__ import *
#-----L I B R A R I E S-----
 
def Calculater(text):
    #print(text)
    #analizing part
    l_operations=[]
    l_names=[["تقسیم","/"],["ضرب","*"],["جمع","هوالع","علاوه","مجموع","+"],["منفی","منهای","-"]]
    #,["توان"],["رادیکال"]
    l_numbers=[]
    text=text.split()
    for item in text:
        if item.isnumeric()==True:
            l_numbers.append(int(item))
        for lis in l_names:
            if item in lis:
                l_operations.append(lis[-1])
    l_full=[]
    for i in range(len(l_operations)):
        l_full.append(l_numbers[i])
        l_full.append(l_operations[i])
    l_full.append(l_numbers[-1])
    #print(l_full)
    while "*" in l_full or "/" in l_full:
        ind_1=100
        ind_2=100
        if "*" in l_full:
            ind_1=l_full.index("*")
        if "/" in l_full:
            ind_2=l_full.index("/")
        ind=min(ind_1,ind_2)
        num_1=l_full[ind-1]
        num_2=l_full[ind+1]
        sum=0
        if l_full[ind]=="*":
            sum=int(num_1*num_2)
        else:
            sum=int(num_1/num_2)
        l_full.pop(ind)
        l_full.pop(ind)
        l_full.pop(ind-1)
        l_full.insert(ind-1,sum)
    while "+" in l_full or "-" in l_full:
        ind_1=100
        ind_2=100
        if "+" in l_full:
            ind_1=l_full.index("+")
        if "-" in l_full:
            ind_2=l_full.index("-")
        ind=min(ind_1,ind_2)
        num_1=l_full[ind-1]
        num_2=l_full[ind+1]
        sum=0
        if l_full[ind]=="+":
            sum=int(num_1+num_2)
        else:
            sum=int(num_1-num_2)
        l_full.pop(ind)
        l_full.pop(ind)
        l_full.pop(ind-1)
        l_full.insert(ind-1,sum)
    TTS(l_full[0],"fa")
def News(category):
    def parse_rss(rss_url):
        return feedparser.parse(rss_url)
    def get_headlines(rss_url):
        headlines = []
        feed = parse_rss(rss_url)
        for newsitem in feed['items']:
            headlines.append(newsitem['title'])

        return headlines
    allheadlines = []

    def start_db(host, user, passwd, db_name):
        conn = sql.connect(
            host="localhost",
            user="root",
            passwd="7221974",
        )
    for key, url in (category).items():
        allheadlines.extend(get_headlines(url))
    #f= open("news.txt","w")
    News=[]
    for hl in allheadlines:
        #f.write(str(hl)+"\n")
        #TTS(hl,"fa")
        News.append(hl)
    SelectedNews=[]
    for i in range (3):
        s=random.choice(News)
        SelectedNews.append(s)
        News.remove(s)
    for New in SelectedNews:
        TTS(New,"fa")
def Translate(text,translated_language):    #return translated text
    translator = Translator()
    result = translator.translate(str(text), dest=str(translated_language))
    translated=result.text
    TTS(translated)
def Joke():
    jokes=['  دیدی درد نداشت؟        جمله نوستالژیک پدر و مادرها بعد آمپول زدن به بچه هاشون در حالی که بچه داره خون گریه میکنه     یعنی اون همه اشک ماله شوق بوده.', ' کار بابام از کولر گذشته       دیگه شبا بلند میشه میاد مودم رو خاموش میکنه!.', ' دکمه روشن کنترلو 20 بار می زنی تلویزیون روشن نمی شه     عصبانی می شی، 2 بار پشت سر هم محکم فشار می دی روشن می شه دوباره خاموش می شه!', ' دیگه به درجه ای از عرفان رسیدم که واسه خودم یه چیزی تعریف می کنم می خندم   تازه آخرش هم از خودم می پرسم جان من؟!', ' یکی از محاسبه هایی که سریع انجام می دیم، محاسبه فاصله من و دادشم و خاهرم نسبت به آیفونه وقتی یکی زنگ درو می زنه!', ' روزگارا که چنین سخت به من می گیری با خبر باش که خیلی داری سخت می گیری دیگه! مسخرشو درآوردی', ' از جلوی یه رستوران رد میشدم دیدم روی درش نوشته: لورل بیا هاردی برو!', ' امروز دست خط خودمو بردم دارو خونه …        بهم دارو داد !', ' یارو ميره تو صف نونوايي، شاطر نونوائی ميگه: نون تا اينجا بيشتر نميرسه، بقيه برن. ميگه: ببخشيد اگه ميشه جمعتر وايسين نون به ما هم برسه', ' اگه میشد دانشمندا یه وسیله اختراع میکردند که از خروپوف برق تولید کنه الان بابام یه نیروگاه هسته ای محسوب می شد !.', ' تا حالا دقت کردین کسایی که خروپف میکنن ،  زودتر خوابشون میبره !؟', ' رفتم دادگستری یارو میپرسه شکایت داشتید؟ گفتم پـَـــ نــه پـَـــ یه خورده برنج آوردم با ترازوی عدالت وزن کنم !.', '  رفتم باغ وحش از نگهبانه میپرسم ببخشید آقا قفس شیرا کجاست ؟ میگه بازدید کننده ای پـَـــ نــه پـَـــ نه از اقوامشون هستم اینورا کاری داشتم گفتم سری بهشون بزنم', '  اومدم در یخچالو باز میکنم دنبال غذا مامانم میگه گشنته؟ پـَـــ نــه پـَـــ اومدم ببینم کی هی چراغ این تو رو خاموش روشن می کنه!.', ' یه بیماری هست اسم نداره اما نتیجه ش     نگهداشتن شیشه عطرها و اسپری های تموم شده ست !.', ' ﺑﻪ ﺑﻌﻀﯽ ﻫﺎ ﺑﺎﻳﺪ ﺑﮕﯽ :  ﺍﮔﻪ ﻭﺍﺳﻪ ﻫﻤﻪ ﻗﺎﻃﯽ ﭘﺎﺗﯽ ﻣﻴﮑﻨﯽ ، ﻭﺍﺳﻪ ﻣﺎ ﻫﻨﻮﺯ ﺗﺎﺗﯽ ﺗﺎﺗﯽ ﻣﻴﮑﻨﯽ !.', ' بدترین چیز اون خنده ی اجباری برای حفظ آبرو بعد از یه زمین خوردن وحشتناکه', ' بعضیا واسه همــه اقیانوس آرام هستن اما تا به ما میرسن میشن تنگهء هرمز!', ' فکر کنم رمز موفقیتمو ۳ بار اشتباه زدم قفل شده ', ' یه وقتایی لازمــه از گوشیمون بشنویم “مشترک مورد نظر آدم نمیباشد … لـــطفا قطع کنید”!', ' امسال نمایشگاه کتاب نرفتم ، خودم تو خونه سیب زمینی سرخ کردم خوردم !', ' زندگی مثل شطرنج میمونه ، البته تو که بچه ای برو منج بازی کن !', ' باهمه وجودم سرمو روشونه مهربون تو میذارم و یواشکی دماغمو با لباست پاک میکنم!!', ' خیلی دلم برات تنگ شده…اونقدر که از دوریت گریه ام میگره… اما وقتی قیافت یادم میاد خندم میگیره!!', ' افتخار نکن که به اندازه تار موهات رفیق داری. وقتی محتاجشون میشی می فهمی که کچلی.', ' وقتی مو تو غذا باشه،فرقی نداره مژه ی دلبر باشه یا سیبیل اصغر آقا!', ' این دهه ۶٠یا که هی نسل سوخته نسل سوخته میکنن   فکر نکنن ما یادمون رفته ماه رمضوناشون تو زمستون بوده ..!', ' جمله ای که من هروقت یه آدم پولدار میبینم واسه آروم کردن خودم میگم: آرامشی که ما داریمو اونا ندارن!!', ' میدونم یکی هست که تو دلش وِلولـس واسه خواستنــم فقط نمیدونم کجاست؟', ' بچه که بودم فکر میکردم زمان قدیم همه جا سیاه سفید بوده', ' بابام ﻣﯿﮕﻪ ﺍﻭﻝﮔﻮﺵ ﮐﻦ ﺑﺒﯿﻦ ﭼﯽ ﻣﯿﮕﻢ     ﺑﻌﺪ ﯾﺎ ﻗﺒﻮﻝ ﮐﻦﯾﺎ ﺑﺮﻭ ﻓﮑﺮﺍﺗﻮ ﮐﻦ ﺑﻌﺪ ﻗﺒﻮﻝ ﮐﻦ !', ' اومدم خونه به مامانم میگم گشنمه، میگه عزیزم نون هس ،تخم مرغ هس، روغنم هس،  برو هر چى دوس دارى درست کن بخور!', ' دو ماهه دارم هر شش ساعت یه بار دوتا آنتی هیستامین میندازم تو جیبام    ولی بازم جیب ما به پول حساسیت داره!', ' یه وختایی نمیرم دمه یخچال که پیشه من شرمنده نشه... خدا هیچ یخچالی رو شرمنده صاحبش نکنه.', ' دیگه کار از کلیپس گذشته برخی از دخترا در حال ساخت مسکن مهر رو سرشون هستند…!', '  اگه قرار باشه اون دنیا تو بهشت موسیقی های خوب گوش کنیم، فک کنم تو جهنم تتلو پخش کنن ', ' من حتی اگه بمیرم مامانم میاد سر قبرم میگه ببین بچه ی فلانی نصف توعه ولی زنده است ', ' پارسال با بابام دعوام شد بهش گفتم بالاخره یه روز از این خونه میرم الان یک ساله هر روز موقع شام و نهار میگه به به, شما که هنوز نرفتی.', '  دوستان نگران نباشید ویروس کرونا زود خراب میشه میمیره چون جنسش چینیه ', '  انقدر که توی سایت ها ربات نبودنمو ثابت کردم توی زندگیم آدم بودنمو ثابت نکردم ', '  دلم برای روزایی که تو دبستان با بچه ها دعوامون میشد کیفشو برمیداشتم پرت کنم میگف ننننددداااازززقران توشه تنگ شده... ', ' هم عاشقتم , هم ازت متنفرم , میانگین که بگیری میبینی برام مهم نیستی !', ' به سلامتی پنگوئن که یه ذره قد داره، اما بازم لاتی راه میره ….', ' بزرگترین حرف های کینه توزانه با این جمله توجیه میشه : ” به خاطر خودت میگم “', ' یه شلغمم نشدیم یکی کوفتمون کنه خوب شه…..!!', ' یه کتابم نشدیم حداقل دوست مهربان بشیم !!', ' طنز بگو', ' حیف نون به باباش میگه : پنکه خراب شدهباباش میگه : خوب معلومه پنج نفری زیرش میخوابین ، میخوای خراب نشه ؟!!', ' ه حیف نون میگن این خیابون کجا میره ؟میگه من ۴۰ ساله تو این خیابون زندگی میکنم تا حالا ندیدم جایی بره !', ' احساسی که با خنده همراه است.']
    TTS(random.choice(jokes),"fa") 
